In [3]:
import pandas as pd
import json
from urllib.request import urlopen

In [4]:
url = "https://gist.githubusercontent.com/yanghung/6f7608dde9bf26d04b6ac64d9a948c94/raw/1076c2e91f641ce9bac12ecb1daf943f507fb81d/nobel_prize.json"
jsonurl = urlopen(url)
text = json.loads(jsonurl.read())

In [5]:
text.keys()

dict_keys(['prizes'])

In [7]:
len(text)

1

In [9]:
text['prizes'][0]

{'year': '2019',
 'category': 'chemistry',
 'laureates': [{'id': '976',
   'firstname': 'John',
   'surname': 'Goodenough',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '977',
   'firstname': 'M. Stanley',
   'surname': 'Whittingham',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '978',
   'firstname': 'Akira',
   'surname': 'Yoshino',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'}]}

In [10]:
# Q1: Average people per year

# Q2: Average people per category per year

In [12]:
df = pd.DataFrame.from_records(text['prizes'])
df.head(3)

,category,laureates,overallMotivation,year
0,chemistry,"[{'id': '976', 'firstname': 'John', 'surname':...",NaN,2019
1,economics,"[{'id': '982', 'firstname': 'Abhijit', 'surnam...",NaN,2019
2,literature,"[{'id': '980', 'firstname': 'Peter', 'surname'...",NaN,2019

In [19]:
len(df['year'].unique())

119

In [21]:
len(df)

646

In [23]:
len(df['laureates'][0])

3

In [24]:
result = []

for i in range(len(df)):
    result.append(len(df['laureates'][0]))

df['num_laureates'] = result
df.head(3)

,category,laureates,overallMotivation,year,num_laureates
0,chemistry,"[{'id': '976', 'firstname': 'John', 'surname':...",NaN,2019,3
1,economics,"[{'id': '982', 'firstname': 'Abhijit', 'surnam...",NaN,2019,3
2,literature,"[{'id': '980', 'firstname': 'Peter', 'surname'...",NaN,2019,3

In [28]:
# Q1: average laureates for year
year = df.groupby(['year']).agg({'num_laureates':'mean'}).reset_index()
category = df.groupby(['category']).agg({'num_laureates':'mean'}).reset_index()
category_year = df.groupby(['year', 'category']).agg({'num_laureates':'mean'}).reset_index()
category

     category  num_laureates
0   chemistry              3
1   economics              3
2  literature              3
3    medicine              3
4       peace              3
5     physics              3

In [31]:
# import seaborn as sns
# sns.distplot(category['num_laureates'])

In [33]:
category_year.describe(include = 'all')

        year category  num_laureates
count    646      646          646.0
unique   119        6            NaN
top     1976    peace            NaN
freq       6      119            NaN
mean     NaN      NaN            3.0
std      NaN      NaN            0.0
min      NaN      NaN            3.0
25%      NaN      NaN            3.0
50%      NaN      NaN            3.0
75%      NaN      NaN            3.0
max      NaN      NaN            3.0

In [38]:
count = 0
res = []

for i in range(len(df)):
    if 'id' in df['laureates'][i]:
        count += 1
        res.append(count)
res

TypeError: argument of type 'float' is not iterable

In [49]:
df2 = pd.DataFrame.from_records(df['laureates'][0])
df2

,firstname,id,motivation,share,surname
0,John,976,"""for the development of lithium-ion batteries""",3,Goodenough
1,M. Stanley,977,"""for the development of lithium-ion batteries""",3,Whittingham
2,Akira,978,"""for the development of lithium-ion batteries""",3,Yoshino

In [50]:
df.head(3)

,category,laureates,overallMotivation,year,num_laureates
0,chemistry,"[{'id': '976', 'firstname': 'John', 'surname':...",NaN,2019,3
1,economics,"[{'id': '982', 'firstname': 'Abhijit', 'surnam...",NaN,2019,3
2,literature,"[{'id': '980', 'firstname': 'Peter', 'surname'...",NaN,2019,3

In [57]:
pd.DataFrame.from_dict(df['laureates'][0])

,firstname,id,motivation,share,surname
0,John,976,"""for the development of lithium-ion batteries""",3,Goodenough
1,M. Stanley,977,"""for the development of lithium-ion batteries""",3,Whittingham
2,Akira,978,"""for the development of lithium-ion batteries""",3,Yoshino

In [66]:
pd.DataFrame.from_records(df['laureates'][0])

,firstname,id,motivation,share,surname
0,John,976,"""for the development of lithium-ion batteries""",3,Goodenough
1,M. Stanley,977,"""for the development of lithium-ion batteries""",3,Whittingham
2,Akira,978,"""for the development of lithium-ion batteries""",3,Yoshino

In [65]:
pd.DataFrame.from_records(df['laureates'][15])

,firstname,id,motivation,share
0,International Campaign to Abolish Nuclear Weap...,948,"""for its work to draw attention to the catastr...",1

In [77]:
# count = 0
res = []

for i in range(len(df)):
    if len(df['laureates'][i]) != 5:
        res.append(i)
res

TypeError: object of type 'float' has no len()

In [71]:
# result = []
# data = []

# for i in range(len(df)):
#     year = df['year'][i]
#     laureates = pd.DataFrame.from_records(df['laureates'][i])
# #     result.append(laureates)
# #     print(year)
#     if len(laureates.columns) == 5:
#         result = pd.DataFrame(laureates)
#     else:
#         break
    
#     data.append(result)
# #     result.append(laureates)
# # df2 = pd.DataFrame(result)
# # df2.head(3)
# # pd.DataFrame(result)
# data

[    firstname   id                                      motivation share  \
 0        John  976  "for the development of lithium-ion batteries"     3
 1  M. Stanley  977  "for the development of lithium-ion batteries"     3
 2       Akira  978  "for the development of lithium-ion batteries"     3

        surname
 0   Goodenough
 1  Whittingham
 2      Yoshino  ,
   firstname   id                                         motivation share  \
 0   Abhijit  982  "for their experimental approach to alleviatin...     3
 1    Esther  983  "for their experimental approach to alleviatin...     3
 2   Michael  984  "for their experimental approach to alleviatin...     3

     surname
 0  Banerjee
 1     Duflo
 2    Kremer  ,
   firstname   id                                         motivation share  \
 0     Peter  980  "for an influential work that with linguistic ...     1

   surname
 0  Handke  ,
   firstname   id                                         motivation share  \
 0      Abiy  981  "for his efforts to achieve peace and internat...     1

      surname
 0  Ahmed Ali  ,
   firstname   id                                         motivation share  \
 0     James  973  "for theoretical discoveries in physical cosmo...     2
 1    Michel  974  "for the discovery of an exoplanet orbiting a ...     4
 2    Didier  975  "for the discovery of an exoplanet orbiting a ...     4

    surname
 0  Peebles
 1    Mayor
 2   Queloz  ,
   firstname   id                                         motivation share  \
 0   William  970  "for their discoveries of how cells sense and ...     3
 1     Peter  971  "for their discoveries of how cells sense and ...     3
 2     Gregg  972  "for their discoveries of how cells sense and ...     3

      surname
 0     Kaelin
 1  Ratcliffe
 2    Semenza  ,
         firstname   id                                         motivation  \
 0      Frances H.  963            "for the directed evolution of enzymes"
 1       George P.  964  "for the phage display of peptides and antibod...
 2  Sir Gregory P.  965  "for the phage display of peptides and antibod...

   share surname
 0     2  Arnold
 1     4   Smith
 2     4  Winter  ,
     firstname   id                                         motivation share  \
 0  William D.  968  "for integrating climate change into long-run ...     2
 1     Paul M.  969  "for integrating technological innovations int...     2

     surname
 0  Nordhaus
 1     Romer  ,
   firstname   id                                         motivation share  \
 0      Olga  979  "for a narrative imagination that with encyclo...     1

      surname
 0  Tokarczuk  ,
   firstname   id                                         motivation share  \
 0     Denis  966  "for their efforts to end the use of sexual vi...     2
 1     Nadia  967  "for their efforts to end the use of sexual vi...     2

    surname
 0  Mukwege
 1    Murad  ,
   firstname   id                                         motivation share  \
 0    Arthur  960  "for the optical tweezers and their applicatio...     2
 1    GÃ©rard  961  "for their method of generating high-intensity...     4
 2     Donna  962  "for their method of generating high-intensity...     4

       surname
 0      Ashkin
 1      Mourou
 2  Strickland  ,
   firstname   id                                         motivation share  \
 0  James P.  958  "for their discovery of cancer therapy by inhi...     2
 1    Tasuku  959  "for their discovery of cancer therapy by inhi...     2

    surname
 0  Allison
 1    Honjo  ,
   firstname   id                                         motivation share  \
 0   Jacques  944  "for developing cryo-electron microscopy for t...     3
 1   Joachim  945  "for developing cryo-electron microscopy for t...     3
 2   Richard  946  "for developing cryo-electron microscopy for t...     3

      surname
 0   Dubochet
 1      Frank
 2  Henderson  ,
     firstname   id                                        motivation share  \
 0  Richard H.  949  "for his contributions to behavioural economics"     1

   surname
 0  Thaler  ,
   firstname   id                                         motivation share  \
 0     Kazuo  947  "who, in novels of great emotional force, has ...     1

     surname
 0  Ishiguro  ]